analysis/tests/Python_gunicorn_test.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        nginx/1.27.1
Server Hostname:        localhost
Server Port:            8100

Document Path:          /
Document Length:        13 bytes

Concurrency Level:      100
Time taken for tests:   21.964 seconds
Complete requests:      100000
Failed requests:        0
Total transferred:      17000000 bytes
HTML transferred:       1300000 bytes
Requests per second:    4552.82 [#/sec] (mean)
Time per request:       21.964 [ms] (mean)
Time per request:       0.220 [ms] (mean, across all concurrent requests)
Transfer rate:          755.84 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.3      0       7
Processing:     3   22   3.5     22      69
Waiting:        3   22   3.5     22      69
Total:          3   22   3.4     22      70

Percentage of the requests served within a certain time (ms)
  50%     22
  66%     23
  75%     24
  80%     24
  90%     25
  95%     27
  98%     29
  99%     31
 100%     70 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        nginx/1.27.1
Server Hostname:        localhost
Server Port:            8100

Document Path:          /
Document Length:        13 bytes

Concurrency Level:      1000
Time taken for tests:   33.604 seconds
Complete requests:      100000
Failed requests:        104
   (Connect: 0, Receive: 0, Length: 104, Exceptions: 0)
Total transferred:      16982320 bytes
HTML transferred:       1298648 bytes
Requests per second:    2975.84 [#/sec] (mean)
Time per request:       336.039 [ms] (mean)
Time per request:       0.336 [ms] (mean, across all concurrent requests)
Transfer rate:          493.52 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   2.1      0      34
Processing:    36  231 785.0    116   31594
Waiting:        0  231 785.0    116   31594
Total:         36  232 785.2    116   31595

Percentage of the requests served within a certain time (ms)
  50%    116
  66%    121
  75%    125
  80%    130
  90%    161
  95%   1118
  98%   1353
  99%   3139
 100%  31595 (longest request)